//
//  Constants.swift
//  Inspection
//
//  Created by apple on 16/4/12.
//  Copyright © 2016年 pz1943. All rights reserved.
//

import Foundation
import UIKit

struct Constants {
    static var NavColor = UIColor(red: 0/255, green: 101/255, blue: 105/255, alpha: 1)
    static var GrayColor = UIColor.groupTableViewBackground    
    static let defaultDelayHour: Double = 10

    static let InspectionTaskDataArray = [
        ["日巡视","机房精密空调（中心站）",1],
        ["周测试","机房精密空调（中心站）",7],
        ["滤网更换","机房精密空调（中心站）",90],
        ["室外机清洁","机房精密空调（中心站）",90],
        ["皮带更换","机房精密空调（中心站）",365],
        ["加湿罐更换","机房精密空调（中心站）",90],
        ["季度测试","机房精密空调（中心站）",90],
        ["周巡视","蓄电池组（中心站）",7],
        ["季度测试","蓄电池组（中心站）",90],
        ["年度放电实验","蓄电池组（中心站）",365],
        ["日巡视","UPS电源（中心站）",1],
        ["周测试","UPS电源（中心站）",7],
        ["温度测试","UPS电源（中心站）",90],
        ["年度检修","UPS电源（中心站）",365],
        ["5年维护","UPS电源（中心站）",1825],
        ["周测试","机房精密空调",7],
        ["滤网更换","机房精密空调",90],
        ["室外机清洁","机房精密空调",90],
        ["皮带更换","机房精密空调",365],
        ["加湿罐更换","机房精密空调",90],
        ["季度测试","机房精密空调",90],
        ["周巡视","蓄电池组",7],
        ["季度测试","蓄电池组",90],
        ["年度放电实验","蓄电池组",365],
        ["周测试","UPS电源",7],
        ["温度测试","UPS电源",90],
        ["年度检修","UPS电源",365],
        ["5年维护","UPS电源",1825],
        ["日巡视","机房精密空调室外机（中心站）",1],
        ["周巡视","机房精密空调室外机",7],
        ["日巡视","隔离变压器",1]]
}
